export const colorMap = {
    // JR East (東日本旅客鉄道)
    "東日本旅客鉄道": {
        "山手線": "#80c241",
        "中央線": "#f15a22",
        "中央本線": "#f15a22",
        "中央線快速": "#f15a22",
        "総武線": "#ffd400",
        "中央・総武緩行線": "#ffd400",
        "京浜東北線": "#00b2e2",
        "根岸線": "#00b2e2",
        "東海道線": "#f68b1e",
        "横須賀線": "#003399",
        "湘南新宿ライン": "#31b980",
        "埼京線": "#009966",
        "京葉線": "#c9242f",
        "武蔵野線": "#f15a22",
        "南武線": "#ffd400",
        "横浜線": "#80c241",
        "東北線": "#f68b1e",
        "宇都宮線": "#f68b1e",
        "常磐線": "#0071c5",
        "常磐線快速": "#00bb85",
        "常磐線各駅停車": "#949495",
        "五日市線": "#f15a22",
        "青梅線": "#f15a22",
        "八高線": "#a09d95",
        "鶴見線": "#ffd400",
        "相模線": "#008689",
        "伊東線": "#378640",
        "奥羽線": "#FE742A",
        "羽越線": "#11B0D3",
        "北陸新幹線": "#03c13d",
        "東北新幹線": "#378640",
        "秋田新幹線": "#e53194",
        "山形新幹線": "#ff6733",
        "上越新幹線": "#ec8c82",
        "川越線": "#a6a9ab",
        "上越線": "#00acd1",
        "信越線": "#73c11d",
        "吾妻線": "#008689",
        "烏山線": "#ff871c",
        "八高線": "#a09d95",
        "日光線": "#ff871c",
        "両毛線": "#fdd700",
        "小海線": "#378640",
        "水郡線": "#378640",
        "水戸線": "#0071c5",
        "内房線": "#0071c5",
        "鹿島線": "#a85f12",
        "久留里線": "#00c3a7",
        "外房線": "#f22335",
        "東金線": "#b31c31",
        "成田線": "#00bb85",
        "高崎線": "#FE8E46",
        "飯山線": "#5bbb24",
        "羽越線": "#00b9db",
        "篠ノ井線": "#cb5f12",
        "白新線": "#f37aa8",
        "磐越西線": "#bc6e23",
        "大糸線": "#957490",
        "只見線": "#0081b8",
        "弥彦線": "#8f0079",
        "米坂線": "#b074d6",
        "仙山線": "#4dc94a",
        "釜石線": "#0071c5",
        "仙石線": "#00acd1",
        "東北本線": "#00bb85",
        "左沢線": "#0072ba",
        "石巻線": "#f76f99",
        "大船渡線": "#ff8b52",
        "大湊線": "#c59411",
        "男鹿線": "#378640",
        "北上線": "#8f0079",
        "気仙沼線": "#4641a4",
        "五能線": "#0081b8",
        "水郡線": "#378640",
        "田沢湖線": "#b074d6",
        "只見線": "#0081b8",
        "津軽線": "#00acd1",
        "八戸線": "#ff463e",
        "花輪線": "#b31c31",
        "磐越東線": "#c5527a",
        "山田線": "#bc6e23",
        "米坂線": "#b074d6",
        "陸羽西線": "#69d485",
        "陸羽東線": "#75787a",
        "越後線": "#378640"
    },
    // Tokyo Metro (東京地下鉄)
    "東京地下鉄": {
        "3号線銀座線": { light: "#ff9500", dark: "#ffb144" },
        "銀座線": { light: "#ff9500", dark: "#ffb144" },
        "4号線丸ノ内線": "#f30100",
        "丸ノ内線": "#f30100",
        "4号線丸ノ内線分岐線": "#f30100",
        "丸ノ内線分岐線": "#f30100",
        "2号線日比谷線": "#9ca5b9",
        "日比谷線": "#9ca5b9",
        "5号線東西線": "#009bda",
        "東西線": "#009bda",
        "9号線千代田線": "#00bb85",
        "千代田線": "#00bb85",
        "8号線有楽町線": "#c1a470",
        "有楽町線": "#c1a470",
        "11号線半蔵門線": "#8f76d6",
        "半蔵門線": "#8f76d6",
        "7号線南北線": "#00ac9a",
        "南北線": "#00ac9a",
        "13号線副都心線": "#9c5e31",
        "副都心線": "#9c5e31"
    },
    // Toei Subway & Tokyo Metropolitan (東京都)
    "東京都": {
        "1号線浅草線": "#e14131",
        "浅草線": "#e14131",
        "6号線三田線": "#006cb6",
        "三田線": "#006cb6",
        "10号線新宿線": "#b0c124",
        "新宿線": "#b0c124",
        "12号線大江戸線": "#c6035d",
        "大江戸線": "#c6035d",
        "荒川線": "#8bc21f",
        "都電荒川線": "#289D4D",
        "日暮里・舎人線": "#E12E75",
        "日暮里・舎人ライナー": "#E12E75"
    },
    // Tokyu (東急電鉄)
    "東急電鉄": {
        "東横線": "#e02428",
        "田園都市線": "#009b72",
        "大井町線": "#f59b00",
        "目黒線": "#009bc5",
        "池上線": "#e0558e",
        "東急多摩川線": "#9a287c",
        "世田谷線": "#ffd400",
        "こどもの国線": "#003f8a"
    },
    // Keikyu (京浜急行電鉄)
    "京浜急行電鉄": {
        "本線": "#df1623",
        "空港線": "#df1623",
        "逗子線": "#df1623",
        "久里浜線": "#df1623",
        "大師線": "#df1623"
    },
    // Keio (京王電鉄)
    "京王電鉄": {
        "京王線": "#e3007f",
        "井の頭線": "#043B77",
        "相模原線": "#e3007f",
        "高尾線": "#e3007f",
        "競馬場線": "#e3007f",
        "動物園線": "#e3007f"
    },
    // Odakyu (小田急電鉄)
    "小田急電鉄": {
        "小田原線": "#007bc3",
        "江ノ島線": "#007bc3",
        "多摩線": "#007bc3"
    },
    // Seibu (西武鉄道)
    "西武鉄道": {
        "新宿線": "#009bc5",
        "拝島線": "#009bc5",
        "西武園線": "#009bc5",
        "国分寺線": "#21A34A",
        "多摩湖線": "#F5A62D",
        "多摩川線": "#EC6F20",
        "池袋線": "#F1712C",
        "西武秩父線": "#F1712C",
        "狭山線": "#F1712C",
        "有楽町線": "#F1712C",
        "豊島線": "#F1712C",
        "山口線": "#EB3F39"
    },
    // Tobu (東武鉄道)
    "東武鉄道": {
        "東上本線": "#003f8a",
        "越生線": "#003f8a",
        "伊勢崎線": "#ffd400",
        "スカイツリーライン": "#ffd400",
        "亀戸線": "#ffd400",
        "野田線": "#00865c",
        "アーバンパークライン": "#00865c",
        "日光線": "#f68b1e"
    },
    // Keisei (京成電鉄)
    "京成電鉄": {
        "京成本線": "#169760",
        "押上線": "#0054af",
        "金町線": "#0054af",
        "千原線": "#0054af",
        "東成田線": "#0054af",
        "成田空港線": "#F1712C"
    },
    // Osaka Metro (大阪市高速電気軌道)
    "大阪市高速電気軌道": {
        "御堂筋線": "#e51837",
        "谷町線": "#9b1c60",
        "四つ橋線": "#007bc3",
        "中央線": "#00984f",
        "千日前線": "#e25d97",
        "堺筋線": "#804000",
        "長堀鶴見緑地線": "#a0d235",
        "今里筋線": "#ee7b1a"
    },
    // JR West (西日本旅客鉄道)
    "西日本旅客鉄道": {
        "大阪環状線": "#f15a22",
        "桜島線": "#99cc00",
        "ゆめ咲線": "#99cc00",
        "東海道線": "#00b2e2",
        "山陽線": "#00b2e2",
        "福知山線": "#ffd400",
        "宝塚線": "#ffd400",
        "関西線": "#ffd400",
        "大和路線": "#ffd400",
        "片町線": "#ffd400",
        "学研都市線": "#ffd400",
        "阪和線": "#ffd400",
        "関西空港線": "#ffd400",
        "紀勢線": "#ffd400",
        "きのくに線": "#ffd400"
    },
    // Hankyu (阪急電鉄)
    "阪急電鉄": {
        "京都線": "#800000",
        "神戸線": "#800000",
        "宝塚線": "#800000",
        "千里線": "#800000",
        "嵐山線": "#800000",
        "伊丹線": "#800000",
        "甲陽線": "#800000",
        "今津線": "#800000"
    },
    // Hanshin (阪神電気鉄道)
    "阪神電気鉄道": {
        "本線": "#002f6c",
        "なんば線": "#ee7b1a",
        "武庫川線": "#002f6c"
    },
    // Keihan (京阪電気鉄道)
    "京阪電気鉄道": {
        "京阪本線": "#006934",
        "中之島線": "#006934",
        "交野線": "#006934",
        "宇治線": "#006934",
        "鴨東線": "#006934"
    },
    "東京モノレール": {
        "東京モノレール羽田線": "#002F78"
    },
    "東京臨海高速鉄道": {
        "りんかい線": "#282B79"
    },
    "いすみ鉄道": {
        "いすみ線": "#FFE74F"
    },
    "しなの鉄道": {
        "しなの鉄道線": "#277B69"
    },
    "わたらせ渓谷鐵道": {
        "わたらせ渓谷線": "#5A1423"
    },
    "伊豆急行": {
        "伊豆急行線": "#00b0de"
    },
    "伊豆箱根鉄道": {
        "駿豆線": "#0D62B3",
        "大雄山線": "#0D62B3"
    },
    "横浜高速鉄道": {
        "みなとみらい線": "#0065B3"
    },
    "京都市": {
        "烏丸線": "#0F8E42",
        "東西線": "#E10F1B"
    }

};